conferences/nodycon2021/presentation.tex
% Created 2021-01-26 Tue 09:58
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[usenames,dvipsnames,svgnames,table]{xcolor}
\newenvironment{note}{\color{red}\bfseries ZZZ}


\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mark Blyth}
\date{}
\title{NODYCON Presentation}
\hypersetup{
 pdfauthor={Mark Blyth},
 pdftitle={NODYCON Presentation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\(\dot{x} = f(x)\)

\(\dot{x} = f(x) + u(x, x^*)\)

\(u \equiv 0 \implies\) system operates under natural dynamics

\(u = k_p(x^* - x)\)

\(x_i = f(t_i) + \varepsilon_i\)

\(\varepsilon_i \sim \mathcal{N}(0, \sigma^2)\)

\section{4 mins Overview}
\label{sec:orge460c03}
\subsection{Numerical Continuation}
\label{sec:orga34ee9f}

\begin{itemize}
\item Numerical continuation is the defacto numerical bifurcation analysis method
\begin{itemize}
\item \textbf{Talk a bit about what it is, how it works, what insights and results have been obtained through numerical continuation}
\end{itemize}
\item Numerical continuation requires a model
\begin{itemize}
\item \textbf{The reason for this is is that numerical continuation is a method for tracing out implicitly defined manifolds, for example a curve representing the equilibrium position of a system at some given parameter value}
\item \textbf{To trace out an implicitly defined manifold, we need an implicit definition, here provided by a model of the system dynamics}
\end{itemize}
\item However in lots of real-world situations, a usable model isn't going to be available
\begin{itemize}
\item Model isn't suitable for use with the traditional continuation packages
\begin{itemize}
\item Agent-based simulations, where we don't have any sort of differential equations to describe the system
\item Models that are computationally very expensive to run
\end{itemize}
\item Or the model doesn't exist
\begin{itemize}
\item Physical experiments
\item Any time we have a real system and we're unable to fully capture its physics using equations, either because its too complicated, or we don't know enough about it
\end{itemize}
\item We still want to study the dynamics of these systems, and continuation is the best tool we have for studying dynamics, so a natural question to ask is whether there's a way we can apply numerical continuation to the cases where an appropriate model isn't available
\end{itemize}
\end{itemize}


\subsection{Control-based continuation [KEEP IT SHORT!]}
\label{sec:org1e3ab4f}

\begin{itemize}
\item Control-based continuation, or CBC, is a reformulation of the traditional continuation paradigm
\begin{itemize}
\item While it can't help with computationally expensive models, \ldots{}
\item It does allow us to define a continuable problem on blackbox and physical systems
\item It allows us to apply continuation methods where our models are either not in the nice form we'd hope for with continuation, or don't exist at all
\end{itemize}

\item\relax [REALLY HIGH-LEVEL OVERVIEW OF HOW cbc WORKS: AIMS TO STABILISE STABLE AND UNSTABLE POs USING FEEDBACK CONTROL, AND TRACK THE SYSTEM'S FREE DYNAMICS BY TRACKING THE CONTROL TARGETS THAT LEAVE THE CONTROLLER SWITCHED OFF]
\begin{itemize}
\item We take a system, which we assume can be modelled by an ODE x dot equals f x
\item We append a control term u to it
\item This control term tries to drive the system to follow some control target x star
\item When u=0 for all time, the system is operating under its free, uncontrolled dynamics
\item Therefore any control target that can be tracked with zero control action must represent the natural, free dynamics of the system
\item If we assume proportional control then u = kp( x star - x), and u is zero when the system exactly tracks its control target
\item If the system were to deviate slightly from its target, the controller would push it back to where it should be, meaning unstable features have been stabilised and can also be observed!
\item We call this noninvasive control; stabilises POs and equilibria, without changing their locations in phase space
\item This gives us a zero-problem to work with -- when there's zero difference between the control target and the system output, our controller remains switched off, and the system is operating under its natural dynamics
\item The CBC zero problem can be embedded into a standard continuation algorithm, to trace out dynamical features of interest
\end{itemize}

\item These dynamical features are typically limit cycles and equilibria
\item For periodic orbits, these control targets are functions, so, much like with standard continuation, we need to discretise them if we want to track them
\begin{itemize}
\item\relax [While in principle there's no reason why they have to be Fourier], the coefficients of a signal's trucated Fourier series are used in all CBC experiments so far, for discretising the signal
\item Multiple-timescale systems typically show rapid shifts in their output signals, which require large numbers of [higher-frequency] fourier harmonics to capture them
\end{itemize}
\end{itemize}
