conferences/nodycon2021/presentation.org
** The role of discretisation

   * All continuation methods use nonlinear solvers for prediction-correction steps
     * Typically Newton or Newton-Broyden
     * When studying nonlinear oscillations, our solvers look for an oscillatory function that can be tracked with zero control action
     * Functions cannot be used as inputs and outputs with standard solvers; instead, they must be discretised
     * The solver is looking for noninvasive control targets, but these are functions and the solver can only handle simple vectors
     * To run the solvers, we must therefore first translate the input function to a vector, apply the solver, then translate its output to a function
     * These transformations are discretisations of the functions
     * They give us a vector-valued representation of the functions, which /can/ be used with the solvers

   * CBC applications use Fourier discretisation
     * The system output is projected onto its first \(n\) Fourier modes, and the projection coefficients are used as the signal discretisation
     * We could use other methods, but there are some good motivations for Fourier
       * First, Fourier explicitly encodes periodicity; this is useful since we're modelling periodic system behaviours
       * Second, the Fourier basis functions have global support, which (one would hope) means they are as effective as possible at averaging out noise
       * It's easy to find noninvasive control: simply find the control target fourier coefficients that produce identical system output fourier coefficients
	 
   * Multiple-timescale systems typically require many Fourier harmonics
     * For the systems studied so far with CBC, signals have been well-described with comparatively few Fourier harmonics
     * For example, a duffing-like oscillator with nonlinear stiffening; it shows off nonlinear behaviours, but the output signal is comparatively sinusoidal
     * This doesn't hold for multiple-timescale systems
     * Even the simplest examples, such as the van der Pol oscillator, show regular transitions between behaviours which require many Fourier harmonics to caputre
     * This is a problem...

   * Larger numbers of Fourier harmonics cause less noise-robustness
     * This means it's hard to apply CBC to multiscale systems as it's difficult to discretise signals to a high degree of accuracy
     * *Insert fig from section 1.2 here*
     * Fourier have infinite support so we would expect them to filter off noise better than other basis functions, so if we were to change the discretisation we would likely see these effects becoming even worse

   * We can't fitler the noise off using simple filters
     * Filters impart a phase shift on the signal, which, while not necessarily problematic, is an extra inconvenience when dealing with phase conditions
     * Filters indiscriminately remove high-frequency information, meaning both noise and important signal information are lost

       
** Surrogate models and surrogate data

   * We can't apply simple filters to the data, and we can't use the raw data as is, otherwise we'll have inaccurate discretisations; instead, we propose a surrogates-based approach
     * We don't consider the data themselves, as they're noise-corrupted
     * Instead, we assume symmetric noise, and fit a nonparametric regression model to the data
     * This model is used in place of -- as a surrogate to -- the real data
     * The surrogate is then discretised instead of the data
     * By choosing the surrogate carefully, we hope to separate the data into signal and noise, thus retaining all the high-frequency information, while avoiding any impact from noise
     * This means that any subsequent analyses will be more noise-robust
     
   * Surrogates are a statistical regression model
     * We use word `model' in the manner typical to the statistical community -- it refers simply to a regressor, rather than an attempt to capture the physics of the system
     * As such, we follow a standard statistical regression procedure
   * Let \(x_i\) be the value of the signal as sampled at time \(t_i\)
   * Let \(\varepsilon_i\) be the random noise that was imposed on the true, underlying noise-free signal at time \(t_i\)
   * We assume that \(\varepsilon_i\) are symmetric i.i.d. with zero-mean
     * *We've stated normal distribution, but actually these methods will usually still get good resuls for any elliptical distribution*
     * Basically, knowing past noise values doesn't tell us anything about the current noise values,
     * All the noise terms are statistically like all the others,
     * And since they're symmetric and zero-mean, the noise, on average, doesn't increase or decrease the average signal value
     * Samples are given by \(x_i = f(t_i) + \varepsilon_i\), where \(f(t)\) is the true, noise-free underlying signal, which we want to study, but don't have access to
       
   * A well-fitted model allows us to separate samples into signal and noise
     * ​That's the core idea with this surrogates approach
     * If we can accurately fit this model, then f(t) captures the true, noise-free signal
     * We can then evaluate f(t), and use the results in place of our noise-corrupted samples
     * This gives us surrogate data which is /not/ noise-corrupted, so can be used to create noise-robust analyses!

   * The challenge now is to find some function \(f(t)\) that is...
     * sufficiently general to describe a wide range of signals
     * and also handle the high statistical nonstationarity expected in multiple timescale systems

     * Nonstationarity loosely means that the behaviours of the signal aren't constant
     * For example, it might exhibit MMOs, and alternate between large and small amplitude oscillations
     * Or it might simply act like a square-wave, such as the vdP oscillator, in which case it alternates beween slowly changing and rapidly changing
     * The key challenge is to find a regression model that can describe nonstationary oscillations, while also being able to separate signal from noise; this turns out to be quite challenging

* 3 mins Meet the surrogates
