conferences/nodycon2021/presentation.tex


\subsection{The role of discretisation}
\label{sec:orgd38d6f4}

\begin{itemize}
\item All continuation methods use nonlinear solvers for prediction-correction steps
\begin{itemize}
\item Typically Newton or Newton-Broyden
\item For periodic orbits CBC, our nonlinear solvers look for the function that can be tracked with zero control action
\end{itemize}

\item Functions cannot be used as solver inputs and outputs; instead, they must be discretised
\begin{itemize}
\item The solver is looking for noninvasive control targets, but these are functions and the solver can only handle simple vectors
\item To run the solvers, we must therefore first translate the input function to a vector, apply the solver, then translate its output to a function
\item These transformations are discretisations of the functions
\item They give us a vector-valued representation of the functions, which \emph{can} be used with the solvers
\end{itemize}

\item CBC applications use Fourier discretisation
\begin{itemize}
\item The system output is projected onto its first \(n\) Fourier modes, and the projection coefficients are used as the signal discretisation
\item We could use other methods, but there are some good motivations for Fourier
\begin{itemize}
\item First, Fourier explicitly encodes periodicity; this is useful since we're modelling periodic system behaviours
\item Second, the Fourier basis functions have global support, which (one would hope) means they are as effective as possible at averaging out noise
\item It's easy to find noninvasive control: simply find the control target fourier coefficients that produce identical system output fourier coefficients
\end{itemize}
\end{itemize}

\item Multiple-timescale systems typically require many Fourier harmonics
\begin{itemize}
\item For the systems studied so far with CBC, signals have been well-described with comparatively few Fourier harmonics
\item For example, a duffing-like oscillator with nonlinear stiffening; it shows off nonlinear behaviours, but the output signal is comparatively sinusoidal
\item This doesn't hold for multiple-timescale systems
\item Even the simplest examples, such as the van der Pol oscillator, show regular transitions between behaviours which require many Fourier harmonics to caputre
\item This is a problem\ldots{}
\end{itemize}

\item Larger numbers of Fourier harmonics cause less noise-robustness
\begin{itemize}
\item This means it's hard to apply CBC to multiscale systems as it's difficult to discretise signals to a high degree of accuracy
\item \textbf{Insert fig from section 1.2 here}
\item Fourier have infinite support so we would expect them to filter off noise better than other basis functions, so if we were to change the discretisation we would likely see these effects becoming even worse
\end{itemize}

\item We can't fitler the noise off using simple filters
\begin{itemize}
\item Filters impart a phase shift on the signal, which, while not necessarily problematic, is an extra inconvenience when dealing with phase conditions
\item Filters indiscriminately remove high-frequency information, meaning both noise and important signal information are lost
\end{itemize}
\end{itemize}


\subsection{Surrogate models and surrogate data}
\label{sec:org18900ce}

\begin{itemize}
\item We can't apply simple filters to the data, and we can't use the raw data as is, otherwise we'll have inaccurate discretisations; instead, we propose a surrogates-based approach
\begin{itemize}
\item We don't consider the data themselves, as they're noise-corrupted
\item Instead, we assume symmetric noise, and fit a nonparametric regression model to the data
\item This model is used in place of -- as a surrogate to -- the real data
\item The surrogate is then discretised instead of the data
\item By choosing the surrogate carefully, we hope to separate the data into signal and noise, thus retaining all the high-frequency information, while avoiding any impact from noise
\item This means that any subsequent analyses will be more noise-robust
\end{itemize}

\item Surrogates are a statistical regression model
\begin{itemize}
\item We use word `model' in the manner typical to the statistical community -- it refers simply to a regressor, rather than an attempt to capture the physics of the system
\item As such, we follow a standard statistical regression procedure
\end{itemize}
\item Let \(x_i\) be the value of the signal as sampled at time \(t_i\)
\item Let \(\varepsilon_i\) be the random noise that was imposed on the true, underlying noise-free signal at time \(t_i\)
\item We assume that \(\varepsilon_i\) are symmetric i.i.d. with zero-mean
\begin{itemize}
\item \textbf{We've stated normal distribution, but actually these methods will usually still get good resuls for any elliptical distribution}
\item Basically, knowing past noise values doesn't tell us anything about the current noise values,
\item All the noise terms are statistically like all the others,
\item And since they're symmetric and zero-mean, the noise, on average, doesn't increase or decrease the average signal value
\item Samples are given by \(x_i = f(t_i) + \varepsilon_i\), where \(f(t)\) is the true, noise-free underlying signal, which we want to study, but don't have access to
\end{itemize}

\item A well-fitted model allows us to separate samples into signal and noise
\begin{itemize}
\item ​That's the core idea with this surrogates approach
\item If we can accurately fit this model, then f(t) captures the true, noise-free signal
\item We can then evaluate f(t), and use the results in place of our noise-corrupted samples
\item This gives us surrogate data which is \emph{not} noise-corrupted, so can be used to create noise-robust analyses!
\end{itemize}

\item The challenge now is to find some function \(f(t)\) that is\ldots{}
\begin{itemize}
\item sufficiently general to describe a wide range of signals
\item and also handle the high statistical nonstationarity expected in multiple timescale systems

\item Nonstationarity loosely means that the behaviours of the signal aren't constant
\item For example, it might exhibit MMOs, and alternate between large and small amplitude oscillations
\item Or it might simply act like a square-wave, such as the vdP oscillator, in which case it alternates beween slowly changing and rapidly changing
\item The key challenge is to find a regression model that can describe nonstationary oscillations, while also being able to separate signal from noise; this turns out to be quite challenging
\end{itemize}
\end{itemize}

\section{3 mins Meet the surrogates}
\label{sec:orgc4d59ce}
