conferences/nodycon2021/presentation.org
** GPR
   * Gaussian processes generalise the normal distribution to infinite dimensions
     * With the standard multivariate normal, any individual variable is normally distributed, and any collection of variables has a multivariate joint distribution
     * This is how Gaussian processes are defined too, only instead of having a finite collection of variables, we have infinitely many
     * This allows us to access our variables using a continuous index set, such as time or spatial position
     * And, as such, GPs represent a probability distribution over functions

   * Gaussian process regression is a nonparametric function-space regression method
     * For a given set of priors, we can use Bayes' rule to condition on data, to update our beliefs about what functions can be used to describe the data
     * This is particularly useful for us, as, while we often have some knowledge of what a signal will look like, we don't usually know exactly what model-form would best describe it
       * Rather, the whole point of CBC is that we can use it when we don't know any models!
     * Since it's Bayesian, we can incorporate our prior beliefs about the signal shape...
     * ...but, being nonparametric, we don't need to specify an exact model-form for what our signals will look like

   * Bayesian methods require priors; GP priors are covariance functions
     * A prior is a belief about how we expect the data to behave, before we've seen any data
     * After we've seen some data, we combine it with our prior to produce a new, updated belief
     * GP priors, also called kernels, specify how similar the function value is to near-by datapoints, at any given point on the curve
     * They can be used to determine, for example, how smooth the latent function is, what amplitude we expect it to have, and how much noise we have in our observations
     * The challenge in using GPR is finding which kernel best encodes beliefs about the data in question

   * Here we compare periodic and non-periodic RBF and Matern 3/2, and Matern 5/2 kernels
     * RBF kernel represents a distribution over C-infinity --smooth functions
     * The Matern family of kernels are a generalisation of this to lower degrees of smoothness
     * Matern 3/2 is once-differentiable and Matern 5/2 is twice-differentiable
     * Relaxing the smoothness requirement tends to work well for real data
     * Periodic kernels also encode a periodicity assumption, and restrict our function priors to functions of a given period
       

FIGURE:
   * Each kernel prior is a Gaussian process; this means they also represent a distribution over functions
   * As a result, we can sample from this distribution
   * To do this, we don't actually extract a random function from the distribution
   * Instead, we select a set of timpoints, and compute the evaluation of a randomly sampled function at these timepoints
   * That means we don't have to explicitly consider infinite-dimensional distributions, which keeps the problem numerically tractable
   * The figure shows a single function sampled from each of the prior distributions
   * For consistency, each prior has the same lengthscale (changeability), and variance (amplitude)
   * Loosely stated, the Matern kernels are seen to be a lot more flexible than the RBF kernel, which turns out to be useful for capturing the rapid changes in the outputs of multiscale systems

** BARS
   
   * Spline regressors are maximally smooth piecewise-polynomial curves
     * They are a popular within the statistical community as a regression method
     * The simplest way to form a spline curve is to interpolate a set of datapoints
     * To do this, we...
       * divide the domain into subintervals, so that each subinterval starts and ends at a consecutive datapoint
       * place a section of polynomial across each subinterval
       * then solving for the coefficients that cause each section of polynomial to
	 * smoothly meet its neighbouring polynomial sections
	 * and to pass through the datapoint at the start and end of its subinterval
     * Typically we use cubic polynomials
     * This turns out to be a numerically reliable interpolation method, however we might have lots of noisy data that we want to smooth, rather than interpolate exactly
     * In this case, BSplines are an easier tool to work with

   * BSplines are a set of basis functions over an associated set of spline curves
     * Any spline curve can be expressed as a linear combination of BSplines
     * The basis functions are defined from a set of scalar-valued knots, which partition the domain into the subintervals we saw before
     * Once we have the basis functions, we can fit a spline curve using, for example, least squares, maybe with an additional smoothness penalty

   * Choosing good BSpline knots can be hard
     * ...and it's important to choose good knots, as they have a big impact on the result
     * However, there's accepted no best way of doing this
     * For smoothing large amounts of data, it is often acceptable to use evenly-spaced knots
     * This doesn't work so well when the data sometimes change rapidly, though
     * An alternative is free-knot splines, where we choose the knots based on the data themselves

   * Bayesian inference can be used to choose knots and coefficients
     * This is called Bayesian free-knot splines
     * It proposes a set of sensible prior beliefs about the data
     * Then combines these with observed data to produce a probability distribution over possible numbers and locations of spline knots
     * We can then draw samples from this distribution using reversible jump MCMC
     * ...and use these samples to estimate a distribution over spline functions
     * We then evaluate these curves at our chosen datapoints to get a distribution over function values
     * If we're wanting point-estimates instead of distributions, as we do here, we simply take the mean


FIGURE:
   * The figure compares BSplines with two other spline methods
     * Cardinal BSplines, where the knots are evenly spaced
     * Smoothing BSplines; this is as implemented in SciPy, so it chooses the number and location of knots to achieve some target smoothness value
   * It uses a fairly standard test function
     * It's good for multiple-timescale systems as it shows a rapid change
     * However, fig doesn't appear in the paper because this is purely an illustative example of how splines behave!
   * All splines methods have their strengths and weaknesses
     * Bayesian free-knot splines require an MCMC engine, which makes them more computationally intensive
   * However, we're always using fairly small amounts of data, so in this example BARS wasn't noticably slower than the other methods
   * The main takeaway from the plot is that it's able to fit the data a lot better than the other methods, as it...
     * chooses its knots based on a combination of smoothing (by explicitly modelling the noise),
     * ...and accuracy, in how well it matches the data
   * Treating the data in a probabilistic, Bayesian manner gives better results than not!

* 2 mins Comparison of their results
