conferences/nodycon2021/presentation.tex
\subsection{GPR}
\label{sec:orgef80547}
\begin{itemize}
\item Gaussian processes generalise the normal distribution to infinite dimensions
\begin{itemize}
\item With the standard multivariate normal, any individual variable is normally distributed, and any collection of variables has a multivariate joint distribution
\item This is how Gaussian processes are defined too, only instead of having a finite collection of variables, we have infinitely many
\item This allows us to access our variables using a continuous index set, such as time or spatial position
\item And, as such, GPs represent a probability distribution over functions
\end{itemize}

\item Gaussian process regression is a nonparametric function-space regression method
\begin{itemize}
\item For a given set of priors, we can use Bayes' rule to condition on data, to update our beliefs about what functions can be used to describe the data
\item This is particularly useful for us, as, while we often have some knowledge of what a signal will look like, we don't usually know exactly what model-form would best describe it
\begin{itemize}
\item Rather, the whole point of CBC is that we can use it when we don't know any models!
\end{itemize}
\item Since it's Bayesian, we can incorporate our prior beliefs about the signal shape\ldots{}
\item \ldots{}but, being nonparametric, we don't need to specify an exact model-form for what our signals will look like
\end{itemize}

\item Bayesian methods require priors; GP priors are covariance functions
\begin{itemize}
\item A prior is a belief about how we expect the data to behave, before we've seen any data
\item After we've seen some data, we combine it with our prior to produce a new, updated belief
\item GP priors, also called kernels, specify how similar the function value is to near-by datapoints, at any given point on the curve
\item They can be used to determine, for example, how smooth the latent function is, what amplitude we expect it to have, and how much noise we have in our observations
\item The challenge in using GPR is finding which kernel best encodes beliefs about the data in question
\end{itemize}

\item Here we compare periodic and non-periodic RBF and Matern 3/2, and Matern 5/2 kernels
\begin{itemize}
\item RBF kernel represents a distribution over C-infinity --smooth functions
\item The Matern family of kernels are a generalisation of this to lower degrees of smoothness
\item Matern 3/2 is once-differentiable and Matern 5/2 is twice-differentiable
\item Relaxing the smoothness requirement tends to work well for real data
\item Periodic kernels also encode a periodicity assumption, and restrict our function priors to functions of a given period
\end{itemize}
\end{itemize}


FIGURE:
\begin{itemize}
\item Each kernel prior is a Gaussian process; this means they also represent a distribution over functions
\item As a result, we can sample from this distribution
\item To do this, we don't actually extract a random function from the distribution
\item Instead, we select a set of timpoints, and compute the evaluation of a randomly sampled function at these timepoints
\item That means we don't have to explicitly consider infinite-dimensional distributions, which keeps the problem numerically tractable
\item The figure shows a single function sampled from each of the prior distributions
\item For consistency, each prior has the same lengthscale (changeability), and variance (amplitude)
\item Loosely stated, the Matern kernels are seen to be a lot more flexible than the RBF kernel, which turns out to be useful for capturing the rapid changes in the outputs of multiscale systems
\end{itemize}

\subsection{BARS}
\label{sec:org231e417}

\begin{itemize}
\item Spline regressors are maximally smooth piecewise-polynomial curves
\begin{itemize}
\item They are a popular within the statistical community as a regression method
\item The simplest way to form a spline curve is to interpolate a set of datapoints
\item To do this, we\ldots{}
\begin{itemize}
\item divide the domain into subintervals, so that each subinterval starts and ends at a consecutive datapoint
\item place a section of polynomial across each subinterval
\item then solving for the coefficients that cause each section of polynomial to
\begin{itemize}
\item smoothly meet its neighbouring polynomial sections
\item and to pass through the datapoint at the start and end of its subinterval
\end{itemize}
\end{itemize}
\item Typically we use cubic polynomials
\item This turns out to be a numerically reliable interpolation method, however we might have lots of noisy data that we want to smooth, rather than interpolate exactly
\item In this case, BSplines are an easier tool to work with
\end{itemize}

\item BSplines are a set of basis functions over an associated set of spline curves
\begin{itemize}
\item Any spline curve can be expressed as a linear combination of BSplines
\item The basis functions are defined from a set of scalar-valued knots, which partition the domain into the subintervals we saw before
\item Once we have the basis functions, we can fit a spline curve using, for example, least squares, maybe with an additional smoothness penalty
\end{itemize}

\item Choosing good BSpline knots can be hard
\begin{itemize}
\item \ldots{}and it's important to choose good knots, as they have a big impact on the result
\item However, there's accepted no best way of doing this
\item For smoothing large amounts of data, it is often acceptable to use evenly-spaced knots
\item This doesn't work so well when the data sometimes change rapidly, though
\item An alternative is free-knot splines, where we choose the knots based on the data themselves
\end{itemize}

\item Bayesian inference can be used to choose knots and coefficients
\begin{itemize}
\item This is called Bayesian free-knot splines
\item It proposes a set of sensible prior beliefs about the data
\item Then combines these with observed data to produce a probability distribution over possible numbers and locations of spline knots
\item We can then draw samples from this distribution using reversible jump MCMC
\item \ldots{}and use these samples to estimate a distribution over spline functions
\item We then evaluate these curves at our chosen datapoints to get a distribution over function values
\item If we're wanting point-estimates instead of distributions, as we do here, we simply take the mean
\end{itemize}
\end{itemize}


FIGURE:
\begin{itemize}
\item The figure compares BSplines with two other spline methods
\begin{itemize}
\item Cardinal BSplines, where the knots are evenly spaced
\item Smoothing BSplines; this is as implemented in SciPy, so it chooses the number and location of knots to achieve some target smoothness value
\end{itemize}
\item It uses a fairly standard test function
\begin{itemize}
\item It's good for multiple-timescale systems as it shows a rapid change
\item However, fig doesn't appear in the paper because this is purely an illustative example of how splines behave!
\end{itemize}
\item All splines methods have their strengths and weaknesses
\begin{itemize}
\item Bayesian free-knot splines require an MCMC engine, which makes them more computationally intensive
\end{itemize}
\item However, we're always using fairly small amounts of data, so in this example BARS wasn't noticably slower than the other methods
\item The main takeaway from the plot is that it's able to fit the data a lot better than the other methods, as it\ldots{}
\begin{itemize}
\item chooses its knots based on a combination of smoothing (by explicitly modelling the noise),
\item \ldots{}and accuracy, in how well it matches the data
\end{itemize}
\item Treating the data in a probabilistic, Bayesian manner gives better results than not!
\end{itemize}

\section{2 mins Comparison of their results}
\label{sec:org726ce5a}
