conferences/nodycon2021/presentation.org
** Testing the surrogates

  * Surrogates are tested on noise-corrupted outputs from simulations of two multiple-timescale models
    * We chose to test on synthetic data from simulations of the vdP oscillator and HH neuron
      * van der Pol oscillator
	* Models relaxation oscillations, which are a widely applicable phenomenon
	* Very simple planar model, keeps things nice and easy
	* We take the time series of the first state variable as the system output
	* Comparatively simple output signal
      * Hodgkin-Huxley neuron
	* van der Pol was chosen because it was easy, HodgkinHuxley was chosen because it was hard
	* The output shows periodic spikes: it alternates between a slow drift and a short sharp oscillation
	* It's a good practical example of multiple-timescale dynamics
	* It also makes for a challenging test of the surrogates, as the rapid changes in the signal make it statistically very nonstationary, which breaks the assumptions of simpler regression models
	* We chose the voltage-like state variable as the system output, since this is what would be measured in real experiments

    * Goodness-of-fit is quantified by fitting the models to noisy data, then comparing the actual and predicted values at unseen datapoints
      * We simulate the vdP and HH models
      * Evaluate the simulated trajectories at a set of evenly spaced time points
      * Noise-corrupt the output samples,
      * Then fit the surrogate to the results.
      * Next, we evaluate both the surrogate and the noise-free trajectory simulation at another set of timepoints, different to those used when fitting the model
      * The mean-square prediction error is calculated over these points, to quantify the goodness-of-fit
	

################################### TABLES HERE ########################

To keep things clear, I've only shown the results from the HodgkinHuxley data
   * The key take-away's are the same for both signals, though
   * The full results are available in the paper

Discussion:
   * With GPR, periodic kernels almost always outperform non-periodic kernels
     * This is to be expected -- since the regressor repeats periodically, we effectively have less model to fit, for the same amount of data
     * This makes it easier to distinguish between signal and noise
     * Fitting periodic kernels can be challenging, as we need an accurate value for the period if we want a good fit
     * Fortunately, an accurate period is also a requirement within the continuation step, so this information will already be available

   * Besides this, none of the kernels stand out as being best
     * There's no one kernel that always outperforms all the others

   * Free-knot splines outperform most gaussian process regressors on the noisy van der Pol signal, and all GPRs with noisy Hodgkin-Huxley data
     * As a rule of thumb, BARS outperforms GPR when the data are more noisy, and more dynamically jumpy
     * Stationary GPR outperforms BARS when data are less noisy, and less dynamically jumpy

   * A major point to note is that all the tested kernels are stationary, and assume constant statistical properties
     * The signals themselves alternate between slow and rapid changes
     * Our kernels are forced to compromise, and produce priors that can encode the rapid changes
     * However this means they are less able to filter out noise when the signal moves slowly
     * One approach to resolving this is to use nonstationary kernel
     * ...which provide more flexibility for describing the signals
     * However, nonstationary kernels are often slower to fit and harder to use than their stationary counterparts, so instead...
     * We took another approach, and used free-knot splines
     * Free-knot splines aren't a gaussian process method, but they can model nonstationary signals
     * Nonstationary GPR has the potential to outperform both, however we deemed it impractical

       
   * In terms of practicalities,
     * The priors for free-knot splines include the number of knots, and the noise distribution
     * It's very easy to come up with good priors, and even if they're not perfect, we still get good results
     * This makes BARS very easy to apply, once it has been coded up
     * On the other hand, it is harder to relate kernels to signal priors
     * While experience will suggest general desirable properties of a kernel, for a given signal, the only way to really know which one is best is to test them out

* TODO 1 min Conclusion
  
** Surrogates in action
We've seen that well-chosen models can remove synthetic noise from synthetic signals
I'm going to quickly jump back to where we started, to explain how they can be used in practice

   * Surrogates appear before the numerical solver to pre-process the system output
     * Taking the same setup as before, we now tag a surrogate model block onto the end
     * As before, the output from this is fed into our discretisation and solver prodcedure

AS SAID BEFORE:
   * In the block diagram, the output of our system is passed to a numerical solver, which aims to solve for u identically zero
   * The solver can't handle the raw output, and instead discretises it
...
   * Only this time, the raw output has been passed through a surrogate before the discretisation step
   * If the surrogate has succeeded, our discretisor-solver input is now considerably less noisy
   * ...which allows the solving step to be executed more accurately

