conferences/nodycon2021/presentation.tex
\subsection{Testing the surrogates}
\label{sec:org3fdb2b1}

\begin{itemize}
\item Surrogates are tested on noise-corrupted outputs from simulations of two multiple-timescale models
\begin{itemize}
\item Here we consider
\begin{itemize}
\item van der Pol oscillator
\begin{itemize}
\item Models relaxation oscillations, which are a widely applicable phenomenon
\item Very simple planar model, keeps things nice and easy
\item We take the time series of the first state variable as the system output
\item Comparatively simple output signal
\end{itemize}
\item Hodgkin-Huxley neuron
\begin{itemize}
\item van der Pol was chosen because it was easy, HodgkinHuxley was chosen because it was hard
\item The output shows periodic spikes: it alternates between a slow drift and a short sharp oscillation
\item It's a good practical example of multiple-timescale dynamics
\item It also makes for a challenging test of the surrogates, as the rapid changes in the signal make it statistically very nonstationary, which breaks the assumptions of simpler regression models
\item We chose the voltage-like state variable as the system output, since this is what would be measured in real experiments
\end{itemize}
\end{itemize}

\item Goodness-of-fit is quantified by fitting the models to noisy data, then comparing the actual and predicted values at unseen datapoints
\begin{itemize}
\item We simulate the vdP and HH models
\item Evaluate the simulated trajectories at a set of evenly spaced time points
\item Noise-corrupt the output samples,
\item Then fit the surrogate to the results.
\item Next, we evaluate both the surrogate and the noise-free trajectory simulation at another set of timepoints, different to those used when fitting the model
\item The mean-square prediction error is calculated over these points, to quantify the goodness-of-fit
\end{itemize}
\end{itemize}
\end{itemize}


\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\# TABLES HERE \#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#\#

Discussion:
\begin{itemize}
\item With GPR, periodic kernels almost always outperform non-periodic kernels
\begin{itemize}
\item This is to be expected -- since the regressor repeats periodically, we effectively have less model to fit, for the same amount of data
\item This makes it easier to distinguish between signal and noise
\item Fitting periodic kernels can be challenging, as we need an accurate value for the period if we want a good fit
\item Fortunately, an accurate period is also a requirement within the continuation step, so this information will already be available
\end{itemize}

\item Besides this, none of the kernels stand out as being best
\begin{itemize}
\item There's no one kernel that always outperforms all the others
\end{itemize}

\item A major point to note is that all the tested kernels are stationary, and assume constant statistical properties
\begin{itemize}
\item The signals themselves alternate between slow and rapid changes
\item Our kernels are forced to compromise, and produce priors that can encode the rapid changes
\item However this means they are less able to filter out noise when the signal moves slowly
\item One approach to resolving this is to use nonstationary kernel
\item \ldots{}which provide more flexibility for describing the signals
\item However, nonstationary kernels are often slower to fit and harder to use than their stationary counterparts, so instead\ldots{}
\item We took another approach, and used free-knot splines
\item Free-knot splines aren't a gaussian process method, but they can model nonstationary signals
\end{itemize}

\item As a result, BARS outperforms most gaussian process regressors on the noisy van der Pol signal,
\begin{itemize}
\item And all GPRs with noisy Hodgkin-Huxley data
\item As a rule of thumb, BARS outperforms GPR when the data are more noisy, and more dynamically jumpy
\item Stationary GPR outperforms BARS when data are less noisy, and less dynamically jumpy
\item Nonstationary GPR has the potential to outperform both, however we deemed it impractical
\end{itemize}

\item In terms of practicalities,
\begin{itemize}
\item The priors for free-knot splines include the number of knots, and the noise distribution
\item It's very easy to come up with good priors, and even if they're not perfect, we still get good results
\item This makes BARS very easy to apply, once it has been coded up
\item On the other hand, it is harder to relate kernels to signal priors
\item While experience will suggest general desirable properties of a kernel, for a given signal, the only way to really know which one is best is to test them out
\end{itemize}
\end{itemize}
