conferences/nodycon2021/presentation.org
** Which to pick when; wider context -- future work, collocation


  * CBC is a method for analysing the bifurcation structure of black-box and physical systems
    * Typically we would use numerical continuation to track points of interest, when an appropriate model is available
    * When an appropriate model is /not/ available, we can still attempt the same style of analysis using control-based continuation

  * Oscillatory dynamics require discretising to be tracked
    * Just like with numerical continuation, we use nonlinear solvers to find and follow our features of interest
    * The solvers can't be applied to the oscillations themselves, as they are functions
    * Instead, we set up a discretisation scheme and run our solvers on that instead

  * It is difficult to accurately Fourier-discretise noisy multiple-timescale signals
    * The signals typically contain large amounts of high-frequency energy
    * Which in turn requires large numbers of Fourier harmonics
    * However the Fourier discretisation loses its noise-averaging power when many harmonics are used
    * If we can't accurately discretise the signals, it becomes a lot harder to track them

  * Bayesian regression models can be used instead to average out the noise
    * If we choose the regression models well, we can obtain noise-free data by sampling the regression models
    * This gives us the possibility of producing more accurate results, as we split the data processing into explicit filtering and discretising steps, instead of hoping that the discretisor also filters
    * Non-Bayesian methods may also work, however the Bayesian approach gives us the double-benefit of
      * good fits to the data when we can encode our prior beliefs about it
      * and nonparametric regressors, so we don't need to specify an exact description of the signal

  * Future work includes alternatives to Fourier discretisation, however these are often even less noise-robust
    * There are lots of other possible discretisation schemes
    * These include replacing the Fourier series with a different set of basis functions,
    * Or applying a collocation scheme instead
    * The collocation discretisation is particularly susceptible to noise-corruption, as the basis functions are not used for averaging the signal
    * Therefore, if collocation is to work, it will require a noise-filtering step such as this
  #+begin_comment
  
LIMITATIONS:
   * We don't explicitly discretise. However, fig1 shows that we can accurately model noise-free multiscale signals with our Fourier discretisation, and fig2 shows that we can use the surrogate to accurately produce noise-free multiscale signals from data, so it wouldn't show much to then apply fourier on top
   * We don't actually test it out in a CBC context; the reason is that this is part of a larger piece of work, and the discretisation methods that this will eventually feed into are still work-in-progress
   * Work-in-progress work highlighted below...

FUTURE WORK:
   * There's still more to be done to get CBC to always play nicely with multiscale systems, such as
     * New phase constraints, instead of phase-locked-loops
     * More efficient systems of discretisation
       * An idea in the works is to use collocation
       * This fits the control target coefficients by requiring equality between the target and the signal at a set of meshpoints
       * If we have a noise-corrupted signal then we'll very likely never get equality, even at noninvasive control
       * Can't say how well surrogates would work for collocation as CBC collocation hasn't been tested yet, however it provides some good context for the expected uses of this method
   * *FIND SOME NON-NEURONAL EXAMPLES OF MULTISCALE SYSTEMS THAT WE MIGHT BE INTERESTED IN ANALYSING WITH CBC*
  #+end_comment
