conferences/nodycon2021/presentation.tex

\section{{\bfseries\sffamily TODO} 1 min Conclusion -- which to pick when; wider context -- future work, collocation}
\label{sec:org72dd3b7}
\begin{itemize}
\item CBC is a method for analysing the bifurcation structure of black-box and physical systems
\begin{itemize}
\item Typically we would use numerical continuation to track points of interest, when an appropriate model is available
\item When an appropriate model is \emph{not} available, we can still attempt the same style of analysis using control-based continuation
\end{itemize}

\item Oscillatory dynamics require discretising to be tracked
\begin{itemize}
\item Just like with numerical continuation, we use nonlinear solvers to find and follow our features of interest
\item The solvers can't be applied to the oscillations themselves, as they are functions
\item Instead, we set up a discretisation scheme and run our solvers on that instead
\end{itemize}

\item It is difficult to accurately Fourier-discretise noisy multiple-timescale signals
\begin{itemize}
\item The signals typically contain large amounts of high-frequency energy
\item Which in turn requires large numbers of Fourier harmonics
\item However the Fourier discretisation loses its noise-averaging power when many harmonics are used
\item If we can't accurately discretise the signals, it becomes a lot harder to track them
\end{itemize}

\item Bayesian regression models can be used instead to average out the noise
\begin{itemize}
\item If we choose the regression models well, we can obtain noise-free data by sampling the regression models
\item This gives us the possibility of producing more accurate results, as we split the data processing into explicit filtering and discretising steps, instead of hoping that the discretisor also filters
\item Non-Bayesian methods may also work, however the Bayesian approach gives us the double-benefit of
\begin{itemize}
\item good fits to the data when we can encode our prior beliefs about it
\item and nonparametric regressors, so we don't need to specify an exact description of the signal
\end{itemize}
\end{itemize}

\item Future work includes alternatives to Fourier discretisation, however these are often even less noise-robust
\begin{itemize}
\item There are lots of other possible discretisation schemes
\item These include replacing the Fourier series with a different set of basis functions,
\item Or applying a collocation scheme instead
\item The collocation discretisation is particularly susceptible to noise-corruption, as the basis functions are not used for averaging the signal
\item Therefore, if collocation is to work, it will require a noise-filtering step such as this
\end{itemize}
\end{itemize}
\end{document}
